package Lesson_5

/**
 * Калькулятор ИМТ
 *
 * Создай консольное приложение на Kotlin, которое будет
 * рассчитывать индекс массы тела (ИМТ) пользователя и
 * определять категорию веса на основе полученного значения.
 *
 * Запроси у пользователя его вес (в килограммах) и рост
 * (в сантиметрах). Вес и рост должны быть переменными типа Double или Float.
 *
 * Преобразуй рост из сантиметров в метры. Используя формулу
 * ИМТ, рассчитай индекс массы тела: ИМТ = масса тела в кг /
 * рост в метрах в квадрате.
 *
 * Используй условные операторы для определения категории
 * ИМТ и выведи сообщение с результатом:
 *
 * - ИМТ < 18.5: Недостаточная масса тела
 *
 * - 18.5 ≤ ИМТ < 25: Нормальная масса тела
 *
 * - 25 ≤ ИМТ < 30: Избыточная масса тела
 *
 * - ИМТ ≥ 30: Ожирение
 *
 * В конце программа должна вывести рассчитанный ИМТ
 * с точностью до двух знаков после запятой и
 * соответствующую категорию веса.
 */